import { SidebarConfig } from "@vuepress/theme-default/lib/shared/nav";

export default [
    {
        text: '星球介绍',
        link: '/',
    },
    {
        text: '星球资料',
        collapsible: true,
        children: ['/星球资料/学习路线', '/星球资料/学习资源', '/星球资料/专属交流群', '/星球资料/鱼皮的学习笔记', '/星球资料/鱼皮的打工日记'],
    },
    '/星球正能量',
    {
        text: '星球项目',
        collapsible: true,
        children: ['/星球项目/用户中心项目', '/星球项目/Java 后端万用项目模板', '/星球项目/伙伴匹配系统', '/星球项目/工作记录分析工具'],
    },
    {
        text: '星球直播',
        collapsible: true,
        children: ['/星球直播/', '/星球直播/往期直播'],
    },
  {
        text: '星球故事',
        collapsible: true,
        children:[// 二层菜单
        {text:'球友经历',collapsible: true,children:[
            '/星球故事/球友经历/小学就开始学编程了，恐怖如斯！',
            '/星球故事/球友经历/小学就自学编程，还黑了学校的广播系统？',
            '/星球故事/球友经历/全栈初中生，牛皮！',
            '/星球故事/球友经历/大一学弟的寒假总结',
            '/星球故事/球友经历/迷茫四年后，我凭这点成功逆袭！',
            '/星球故事/球友经历/别人要看源码，那我也要看',
            '/星球故事/球友经历/都这个点儿了，这帮人竟然在。。。',
            '/星球故事/球友经历/开始认真了！'
        ]},
        
            {text:'求职面经',collapsible: true,children:[
                '/星球故事/求职面经/帮改简历，发现了一些 “通病” ！',
                '/星球故事/求职面经/刚面完字节跳动，估计凉了',
                '/星球故事/求职面经/大二学弟刚面完字节，热乎！',
                '/星球故事/求职面经/想旷课去参加实习了。。'
            ]},

            {text:'上岸分享',collapsible: true,children:[
                '/星球故事/上岸分享/春招上岸啦！',
                '/星球故事/上岸分享/学弟进小米了！',
                '/星球故事/上岸分享/学弟找我来报喜了！'
            ]},

            {text:'星球打卡',collapsible: true,children:[
                '/星球故事/星球打卡/一季度打卡总结.html'
            ]},

            {text:'问题解惑',collapsible: true,children:[
                '/星球故事/问题解惑/考研还是就业？经典问题',
                '/星球故事/问题解惑/刚入职新公司，代码看不懂咋办？'
            ]},

            {text:'星主分享',collapsible: true,children:[
                '/星球故事/星主分享/我的项目完成啦！！！',
                '/星球故事/星主分享/鱼皮，你太细了！',
                '/星球故事/星主分享/一起讨论权限管理需求',
                '/星球故事/星主分享/怎么做个不用网络的软件？'
            ]}
        ],
        // children: ['/星球故事/星球打卡/一季度打卡总结'],
    },
    {
        text: '关于星主',
        collapsible: true,
        children: ['/关于星主/', '/关于星主/个人经历'],
    },
    '/加入星球',
] as SidebarConfig;